{
    "blogEntries": [
        {
            "date": "Thursday October 26",
            "tag": "NSS Pagination Main",
            "title": "Pagination",
            "content": "Today I'm going to attempt pagination on this page. If im successful you may see multiple crazy or repeated entries... "
        },
        {
            "date": "Wednesday October 25",
            "tag": "NSS",
            "title": "Lexscopawhaa?",
            "content": "Instructor Steve was nice enough to draw out a course map for us today.. apparently we are on the edge of the hook of dispair.. next stop lexscopistan"
        },
        {
            "date": "Tuesday October 24",
            "tag": "NSS",
            "title": "Just keep swimming...",
            "content": "Today we got interviewed by the instructors of the class so that they could better asses our needs. Meg was awesome, and assured me that feeling like everyone else in the class knows more than I do..was completely normal... Just keep swimming."
        },
        {
            "date": "Monday October 23",
            "tag": "NSS",
            "title": "Foomergency - it's definitely a monday",
            "content": "So, Foo Fighters have cancelled the show in Nashville tonight, My master bathroom window has a broken seal and my bathroom now has a waterfall feature! Today we were introduced to array methods and chaining. I also spent hours trying to chain .forEach before discovering that it cannot be chained. Woo!"
        },
        {
            "date": "Monday October 16",
            "tag": "NSS",
            "title": "Group project part Deux! the groupening!",
            "content": "Ok so instructor Steve was Soooo impressed with our projectes we get to do it all over again with new teams and new people."
        },
        {
            "date": "Friday October 13",
            "tag": "NSS",
            "title": "Ok.. second week over",
            "content": "Oh man, Friday the 13th and we had to complete our first group project, launching a company website using a database constructed and pushed to local storage. I didn't think we were going to have anything to present due to a gitastrophy as instructor Steve would call it, but the team pulled it out at the last second. I feel like I have a better understanding of git and pushing things to local storage. Let's just hope that my own brain stores it!"
        },
        {
            "date": "Friday October 6th",
            "tag": "NSS",
            "title": "End of my first week at NSS",
            "content": "So it's 2:50pm Friday October 6th 2017. How are things going? Well I havent thrown myself out the window yet! So lets take that as a personal victory. We've talked about a lot of stuff. I clearly don't understand any of it, but they keep telling me that's ok. I'm looking forward to next week! So stay tuned! "
        }
    ],
    "contactEntries": [
        {
            "platformName": "Facebook",
            "userName": "Raymond J Medrano",
            "url": "https://www.facebook.com/raymond.j.medrano",
            "platformIcon": "./images/facebook.png"
        },
        {
            "platformName": "LinkedIn",
            "userName": "Raymond Medrano",
            "url": "https://www.linkedin.com/in/raymond-medrano-02477214/",
            "platformIcon": "./images/linkedin.png"
        },
        {
            "platformName": "Twitter",
            "userName": "@Fuzzbear",
            "url": "https://twitter.com/fuzzbear",
            "platformIcon": "./images/icon-twitter.png"
        }
    ],
    "resumeEntries": [
        {
            "company": "Borgwarner",
            "title": "Quality Systems Technician",
            "duration": "2005 - 2017",
            "responsibilities": "Responsible for  the creation and  or maintenance of all electronic systems related to quality assurance at the plant level including but not limited to: SharePoint Administration of plants quality team site. Administrative control of all document control systems. Administrative control of plant wide change management system. Administrative control of layered process audit system. Responsible for layered process audit development, deployment, scheduling and verification of corrective action. Internal Auditing for TS16949, ISO140001 and AS9100.  Assist Manufacturing Engineering in the creation of Operator Work Instruction and Documentation for new processes launched in the plant. "
        },
        {
            "company": "Borgwarner",
            "title": "Process Control Technician",
            "duration": "2002 - 2005",
            "responsibilities": "Responsible for maintaining all Controlled Quality Documentation for QS-9000 / TS16949 Quality Systems. Assisted cross functional Engineering teams, performing Tests, Running DOE's and Investigating Customer Issues/Concerns. Implemented Plant Wide Electronic Statistical Process Control Software including Training of End Users and Support Staff Performed Weekly Layered Audits of Production Departments to help maintain QS-9000 / TS16949 Compliance. Served on 8D Teams to help resolve customer issues. "
        },
        {
            "company": "Borgwarner",
            "title": "Team Leader",
            "duration": "1998 - 2002",
            "responsibilities": "Responsible for overseeing daily operations on a shift basis of 40+ production operators working in various Cells. Helped Shift supervisor make decisions based on customer requirements, manufacturing capacity, and Machine Uptime. Used Kan-Ban Inventory system to relocate operators to operations that were most needed. Performed Basic Set-up / Maintenance on Furnace Bonding Equipment, 80 ton OBI presses, and Metal Roll forming Machines."
        }
    ],
    "projectEntries": [
        {
            "projectName": "Real Emergency Website",
            "completeDate": "October 18th 2017",
            "techUsed": "HTML, CSS, JavaScript",
            "team": "Max Wolf, Jesse Page, Lissa Goforth",
            "linkToView": "https://github.com/nss-day-cohort-22/company-website-lopsided-pelicans"
        },
        {
            "projectName": "Nostrum Company Website",
            "completeDate": "October 13th 2017",
            "techUsed": "HTML, CSS, JavaScript",
            "team": "Greg Lawrence, Kolden Prue, Jenna Solis",
            "linkToView": "https://github.com/nss-day-cohort-22/company-website-ceaseless-ravens"
        },
        {
            "projectName": "Personal Site",
            "completeDate": "TBD - Ongoing",
            "techUsed": "HTML, CSS, JavaScript",
            "team": "none",
            "linkToView": "https://rmbw74.github.io"
        }
    ]
}